Repository: GeopJr/Collision
Catalog: po/*.po
Languages: ar, ca, de, el, fr, hr, it, nb_no, ta, vi

source: Collision
ar: تصادم
ca: Col·lisió
el: Σύγκρουση
ta: கொலிஸன்
vi: Trùng khóa

source: Hash Generator
ar: مولِّد تلبيد
ca: Generador de hash
de: Prüfsummengenerator
el: Γεννήτρια Hash
fr: Générateur de hachages
hr: Generator hasheva
it: Generatore di hash
nb_no: Avtrykk
ta: ஹாஷ் ஜெனரேட்டர்
vi: Thuật toán băm

source: Check hashes for your files
ar: تحقَّق من تلبيد ملفَّاتك
ca: Comprovar els hashes dels teus fitxers
de: Prüfen Sie die Prüfsummen Ihrer Dateien
el: Ελέγξτε hashes για τα αρχεία σας
fr: Vérifiez les hachages de vos fichiers
hr: Provjeri hasheve tvojih datoteka
it: Calcola le hash dei tuoi file
nb_no: Sjekk avtrykkene til filer
ta: உங்கள் கோப்புகளுக்கான ஹாஷ்களை சரிபார்க்கவும்
vi: Kiểm băm cho tập tin

source: md5;sha1;sha256;sha512;blake3;crc32;adler32;hash;
ar: md5;sha1;sha256;sha512;blake3;crc32;adler32;hash;تلبيد;
de: md5;sha1;sha256;sha512;blake3;crc32;adler32;hash;Prüfsumme;
nb_no: md5;sha1;sha256;sha512;blake3;crc32;adler32;hash;avtrykk;verifisering;kryptering;
vi: md5;sha1;sha256;sha512;blake3;crc32;adler32;hash;băm;

source: Verifying that a file you downloaded or received is actually the one you were expecting is often overlooked or too time-consuming to do. At the same time, it has become very easy to get your hands on a file that has been tampered with, due to the mass increase of malicious webpages and other actors.
ar: يشيع التغافل عن التحقق من أن الملفات التي نزَّلتها هي حقًا ما تريد، ولعل سبب ذلك هو استغراقه وقتًا كثيرًا، ويتزامن هذا مع سهولة الحصول على ملفات معدلة، وذلك لأن أعداد الصفحات الخبيثة وغيرهم من جهات يزداد تزايدًا.
ca: Verificar que un fitxer que has descarregat o rebut és realment el que s'esperaves és una cosa que sovint es passa per alt o que porta massa temps. Alhora, s'ha tornat molt fàcil aconseguir un arxiu que ha estat manipulat, a causa de l'augment massiu de pàgines web malicioses i altres actors.
de: Die Überprüfung, ob eine heruntergeladene oder empfangene Datei tatsächlich die erwartete Datei ist, wird oft übersehen oder ist zu zeitaufwendig. Gleichzeitig ist es aufgrund der massiven Zunahme bösartiger Webseiten und anderer Akteure sehr einfach geworden, an böswillig manipulierte Dateien zu gelangen.
el: Η επαλήθευση ότι ένα αρχείο που κατεβάσατε ή παραλάβατε είναι πράγματι αυτό που περιμένατε, συχνά παραβλέπεται ή είναι πολύ χρονοβόρα για να γίνει. Ταυτόχρονα, έχει γίνει πολύ εύκολο να πέσει στα χέρια σας ένα αρχείο που έχει αλλοιωθεί, λόγω της μαζικής αύξησης των κακόβουλων ιστοσελίδων και άλλων φορέων.
fr: Vérifier qu'un fichier que vous avez téléchargé ou reçu est bien celui que vous attendiez est souvent une tâche négligée ou trop longue à faire. Dans le même temps, il est devenu très facile, à cause de l'augmentation de pages web malveillantes ou d'autres acteurs de ce type, de mettre la main par mégarde sur un fichier altéré ou corrompu.
hr: Potvrđivanje da se pri preuzetoj ili primljenoj datoteci doista radi o očekivanoj datoteci često se zanemaruje ili oduzima previše vremena. Istovremeno je postalo sve jednostavnije manipulirati datoteke zbog masovnog povećanja zlonamjernih web-stranica i drugih aktera.
it: Verificare che un file scaricato o ricevuto sia effettivamente quello che ti aspetti è spesso trascurato o richiede troppo tempo. Al tempo stesso, tuttavia, per vari motivi tra cui l'aumento dei siti maligni è diventato molto facile ritrovarsi in mano un file manomesso.
nb_no: Å passe på at en fil du har lastet ned eller mottatt faktisk er den du forventet, kan være tidkrevende og tilsynelatende uviktig. Samtidig blir det stadig enklere å ende opp med filer som har blitt tuklet med, på grunn av en massiv økning i ondsinnede nettsteder og aktører.
ta: நீங்கள் பதிவிறக்கம் செய்த அல்லது பெற்ற கோப்பு உண்மையில் நீங்கள் எதிர்பார்த்ததுதானா என்பதைச் சரிபார்ப்பது பெரும்பாலும் கவனிக்கப்படுவதில்லை அல்லது செய்ய அதிக நேரத்தை எடுத்துக்கொள்ளும். அதே நேரத்தில், தீங்கிழைக்கும் வலைப்பக்கங்கள் மற்றும் பிற நடிகர்களின் பெருமளவிலான அதிகரிப்பு காரணமாக, சிதைக்கப்பட்ட கோப்பை உங்கள் கைகளில் பெறுவது மிகவும் எளிதானது.
vi: Sau khi tải xong hay nhận được tập tin, người dùng thường bỏ qua khâu kiểm tra xem tập tin có còn nguyên vẹn hay không. Khi cần kiểm, họ phải tốn rất nhiều thì giờ và công sức. Đồng thời, khả năng tải về những tập tin đã bị can thiệp ngày càng cao do số lượng website và hacker ngày một gia tăng.

source: This tool aims to solve that. Collision comes with a simple &amp; clean UI, allowing anyone, from any age and experience group, to generate, compare and verify MD5, SHA-256, SHA-512, SHA-1, Blake3, CRC32 and Adler32 hashes.
ar: تهدف هذه الأداة لإصلاح هذا. يأتي «تصادم» مع واجهة واضحة وبسيطة، مما يتيح لأي أحد بغض النظر عن عمره أو خبرته توليد ومقارنة تلبيدات MD5، وSHA-256، وSHA-512، وSHA-1، وBlake3، وCRC32، وAdler32.
de: Diese Anwendung versucht, das Problem zu lösen. Collision hat eine einfache Benutzeroberfläche, die es jedem ermöglicht, Prüfsummen (MD5, SHA-256, SHA-512, SHA-1, Blake3, CRC32 und Adler32) zu generieren und zu vergleichen - egal wie alt oder welcher Kenntnisstand.
el: Αυτό το εργαλείο έχει ως στόχο να το λύσει. Το Collision έρχεται με ένα απλό και καθαρό UI, επιτρέποντας σε οποιονδήποτε, από οποιαδήποτε ηλικιακή ομάδα και ομάδα εμπειρίας, να δημιουργήσει, να συγκρίνει και να επαληθεύσει MD5, SHA-256, SHA-512, SHA-1, Blake3, CRC32 και Adler32 hashes.
fr: Cet outil vise à résoudre ce problème. Collision vient avec une simple interface utilisateur, permettant à toute personne, quel que soit son âge ou son niveau d'expérience, de générer, comparer et vérifier les hachages MD5, SHA-256, SHA-512, SHA-1, Blake3, CRC32 et Adler32.
hr: Cilj ovog alata je rješavanje tog problema. Collision pruža jednostavno korisničko sučelje te omogućuje svakome bilo koje dobi i iskustva, generirati, usporediti i potvrditi MD5, SHA-256, SHA-512, SHA-1, Blake3, CRC32 i Adler32 hasheve.
it: Questo strumento mira a risolverlo. Collision arriva con un semplice &amp; interfaccia utente pulita, che consente a chiunque, di qualsiasi età ed esperienza, di generare, confrontare e verificare gli hash MD5, SHA-256, SHA-512, SHA-1, Blake3, CRC32 e Adler32.
nb_no: Collision har som mål å være løsningen på dette problemet. Appen er utformet for at hvem som helst, uansett alder eller erfaring, skal kunne generere, sammenligne og verifisere forskjellige filavtrykk, som MD5, SHA-256, SHA-512, SHA-1, Blake3, CRC32 eller Adler32.
ta: இந்தக் கருவி அதைத் தீர்ப்பதை நோக்கமாகக் கொண்டுள்ளது. கொலிஸன் ஒரு எளிய &amp; சுத்தமான UI, MD5, SHA-256, SHA-512, SHA-1, Blake3, CRC32 மற்றும் Adler32 ஹாஷ்களை உருவாக்க, ஒப்பிட்டு மற்றும் சரிபார்க்க, எந்த வயது மற்றும் அனுபவக் குழுவைச் சேர்ந்தவர்களையும் அனுமதிக்கிறது.
vi: Công cụ này là nhằm giải quyết vấn đề trên. Trùng khóa là một ứng dụng tiện lợi &amp; đẹp mắt, tạo điều kiện cho mọi người từ mọi lứa tuổi và chuyên ngành dễ dàng tạo, so sánh và kiểm tra tập tin thông qua các thuật toán băm như MD5, SHA-256, SHA-512, SHA-1, Blake3, CRC32 hay Adler32.

source: _New Window
ar: نافذة _جديدة
de: _Neues Fenster
el: _Νέο Παράθυρο
fr: _Nouvelle fenêtre
hr: _Novi prozor
it: _Nuova finestra
nb_no: _Nytt vindu
ta: புதிய சாளரம் (_N)
vi: Cửa sổ _mới

source: _Compare Hash Functions
ar: _قارن وظائف التلبيد
ca: _Comparar funcions hash
de: Prüfsummen-Funktionen verglei_chen
el: _Σύγκριση Συναρτήσεων Hash
fr: _Comparer les fonctions de hachage
hr: _Usporedi hash funkcije
it: _Compara funzioni di hash
nb_no: _Sammenlign funksjoner
ta: _ஹாஷ் செயல்பாடுகளை ஒப்பிடுக
vi: _So sánh hàm băm

source: _Keyboard Shortcuts
ar: ا_ختصارات لوح المفاتيح
ca: _Dreceres de teclat
de: _Tastenkürzel
el: _Συντομεύσεις Πληκτρολογίου
fr: Raccourcis _clavier
hr: _Tipkovni prečaci
it: _ Scorciatoie da tastiera
nb_no: _Tastatursnarveier
ta: _விசைப்பலகை குறுக்குவழிகள்
vi: _Phím tắt

source: _About Collision
ar: _عَنْ «تصادم»
ca: _Sobre Col·lisió
de: _Info zu Collision
el: Σχετικά με το _Collision
fr: _À propos de Collision
hr: O _aplikaciji Collision
it: _Informazioni su Collision
nb_no: _Om Collision
ta: _கொலிஸனைப் பற்றி
vi: _Giới thiệu Trùng khóa

source: Choose a File
ar: اختر ملفًّا
ca: Triar un fitxer
de: Eine Datei wählen
el: Επιλέξτε ένα Αρχείο
fr: Choisir un fichier
hr: Odaberi datoteku
it: Apri file
nb_no: Velg fil
ta: ஒரு கோப்பைத் தேர்ந்தெடுக்கவும்
vi: Chọn tập tin

source: _Open
ar: ا_فتح
ca: _Obrir
de: _Öffnen
el: _Ανοίξτε
fr: _Ouvrir
hr: _Otvori
it: _Apri
nb_no: _Åpne
ta: _திற
vi: _Mở

source: Open…
ar: افتح…
ca: Obrir…
de: Öffnen …
el: Ανοίξτε…
fr: Ouvrir…
hr: Otvori …
it: Apri…
nb_no: Åpne…
ta: திற…
vi: Mở…

source: Menu
ar: القائمة
ca: Menú
de: Menü
el: Μενού
hr: Izbornik
nb_no: Hovedmeny
ta: மெனு

source: _Open a File
ar: ا_فتح ملفًا
ca: _Obrir un fitxer
de: Eine Datei _öffnen
el: _Ανοίξτε ένα Αρχείο
fr: _Ouvrir un fichier
hr: _Otvori datoteku
it: _Apri un file
nb_no: _Åpne fil
ta: _ஒரு கோப்பைத் திறக்கவும்
vi: _Mở tập tin

source: Calculating Hashes
ar: يحسب التلبيدات
de: Prüfsummen werden berechnet
el: Υπολογισμός Hashes
fr: Calcul des hachages
hr: Izračunavanje hasheva
it: Calcolo degli hash
nb_no: Genererer avtrykk
ta: ஹாஷ்களைக் கணக்கிடுகிறது
vi: Đang tính giá trị băm

source: This might take a while
ar: سيستغرق هذا فترة
de: Das könnte eine Weile dauern
el: Αυτό μπορεί να πάρει λίγη ώρα
fr: Cela peut prendre du temps
hr: Ovo može potrajati
it: L'operazione potrebbe richiedere del tempo
nb_no: Dette kan ta en stund
ta: இதற்கு சிறிது நேரம் ஆகலாம்
vi: Có thể mất một lúc

source: Hash
ar: التلبيد
de: Prüfsumme
fr: Hachage
nb_no: Generer
ta: ஹாஷ்
vi: Băm

source: Verify
ar: تحقَّق
ca: Verificar
de: Verifizieren
el: Επαληθεύστε
fr: Vérifier
hr: Potvrdi
it: Verifica
nb_no: Verifiser
ta: சரிபார்க்கவும்
vi: Kiểm

source: Checksum
ar: تدقيق المجموع
ca: Suma de control
de: Prüfsumme
fr: Somme de contrôle
hr: Kontrolni zbroj
nb_no: Avtrykk
ta: செக்சம்
vi: Băm tổng kiểm

source: MD5,SHA-1,SHA-256,SHA-512,Blake3,CRC32 or Adler32 Hash
ar: تلبيد MD5، وSHA-1، وSHA-256، وSHA-512، وBlake3، وCRC32، وAdler32
de: MD5, SHA-1, SHA-256, SHA-512, Blake3, CRC32 oder Adler32-Prüfsumme
el: MD5,SHA-1,SHA-256,SHA-512,Blake3,CRC32 ή Adler32 Hash
fr: Hachages MD5,SHA-1,SHA-256,SHA-512,Blake3,CRC32 ou Adler32
hr: MD5,SHA-1,SHA-256,SHA-512,Blake3,CRC32 ili Adler32 Hash
it: Hash MD5,SHA-1,SHA-256,SHA-512,Blake3,CRC32 o Adler32
nb_no: MD5, SHA-1, SHA-256, SHA-512, Blake3, CRC32 eller Adler32-avtrykk
ta: MD5,SHA-1,SHA-256,SHA-512,Blake3,CRC32 அல்லது Adler32 Hash
vi: Băm loại MD5,SHA-1,SHA-256,SHA-512,Blake3,CRC32 hay Adler32

source: Insert a MD5/SHA-1/SHA-256/SHA-512/Blake3/CRC32/Adler32 Hash
ar: أدرِج تلبيد MD5/SHA-1/SHA-256/SHA-512/Blake3/CRC32/Adler32
de: Fügen Sie eine MD5/SHA-1/SHA-256/SHA-512/Blake3/CRC32/Adler32-Prüfsumme ein
el: Εισάγετε ένα MD5/SHA-1/SHA-256/SHA-512/Blake3/CRC32/Adler32 Hash
fr: Insérer une hachage MD5 / SHA-1 / SHA-256 / SHA-512 / Blake3 / CRC32 / Adler32
hr: Umetni MD5/SHA-1/SHA-256/SHA-512/Blake3/CRC32/Adler32 Hash
it: Inserisci un hash MD5/SHA-1/SHA-256/SHA-512/Blake3/CRC32/Adler32
nb_no: Sett inn et MD5/SHA-1/SHA-256/SHA-512/Blake3/CRC32/Adler32-avtrykk
ta: MD5/SHA-1/SHA-256/SHA-512/Blake3/CRC32/Adler32 Hash ஐச் செருகவும்
vi: Điền băm loại MD5/SHA-1/SHA-256/SHA-512/Blake3/CRC32/Adler32

source: File
ar: ملف
ca: Fitxer
de: Datei
el: Αρχείο
fr: Fichier
hr: Datoteka
nb_no: Fil
ta: கோப்பு
vi: Tập tin

source: Select Another File to Check Against
ar: اختر ملفًا آخر لتقارنه
ca: Seleccionar un altre fitxer a comprovar
de: Wählen Sie eine weitere Datei zum Prüfen aus
el: Επιλέξτε ένα Άλλο Αρχείο για Έλεγχο
fr: Sélectionner un autre fichier pour vérifier la correspondance
hr: Odaberi jednu drugu datoteku za usporedbu
it: Seleziona un altro file da confrontare
nb_no: Velg en annen fil å sammenligne med
ta: எதிராகச் சரிபார்க்க மற்றொரு கோப்பைத் தேர்ந்தெடுக்கவும்
vi: Chọn một tập tin khác để đối chiếu

source: Choose File…
ar: اختر ملفًا…
ca: Triar el fitxer…
de: Datei auswählen …
el: Επιλέξτε Αρχείο…
fr: Choisir un fichier…
hr: Odaberi datoteku …
it: Scegli file…
nb_no: Velg fil…
ta: கோப்பை தேர்வு செய்யவும்…
vi: Chọn tập tin…

source: Copy
ar: انسخ
ca: Copiar
de: Kopieren
el: Αντιγραφή
fr: Copier
hr: Kopiraj
it: Copia
nb_no: Kopier
ta: நகல்
vi: Sao chép

source: General
ar: عام
de: Allgemein
el: Γενικά
fr: Général
hr: Opće
it: Generale
nb_no: Generelt
ta: பொது
vi: Chung

source: Open a File
ar: افتح ملفًا
ca: Obrir un fitxer
de: Eine Datei öffnen
el: Ανοίξτε ένα Αρχείο
fr: Ouvrir un fichier
hr: Otvori datoteku
it: Apri un file
nb_no: Åpne en fil
ta: ஒரு கோப்பைத் திறக்கவும்
vi: Mở tập tin

source: Show Keyboard Shortcuts
ar: أظهِر اختصارات لوحة المفاتيح
ca: Mostra les dreceres de teclat
de: Tastenkürzel anzeigen
el: Εμφάνιση Συντομεύσεων Πληκτρολογίου
fr: Afficher les raccourcis clavier
hr: Pokaži tipkovne prečace
it: Mostra scorciatoie da tastiera
nb_no: Vis tastatursnarveier
ta: விசைப்பலகை குறுக்குவழிகளைக் காட்டு
vi: Xem phím tắt

source: New Window
ar: نافذة جديدة
de: Neues Fenster
el: Νέο Παράθυρο
fr: Nouvelle fenêtre
hr: Novi prozor
it: Nuova finestra
nb_no: Nytt vindu
ta: புதிய சாளரம்
vi: Cửa sổ mới

source: Close Window
ar: أغلِق النافذة
de: Fenster schließen
el: Κλείστε το Παράθυρο
fr: Fermer la fenêtre
hr: Zatvori prozor
it: Chiudi finestra
nb_no: Lukk vindu
ta: சாளரத்தை மூடு
vi: Đóng cửa sổ

source: Quit
ar: غادِر
ca: Sortir
de: Beenden
el: Έ_ξοδος
fr: Quitter
hr: Zatvori program
it: Esci
nb_no: Avslutt
ta: வெளியேறு
vi: Thoát

source: Check Hashes
ar: تحقَّق من التلبيدات
ca: Comprovar els hashes
de: Prüfsummen prüfen
el: Ελέγξτε Hashes
fr: Vérifier les sommes de contrôle
hr: Provjeri hasheve
it: Controlla hash
nb_no: Kontroller avtrykk
ta: ஹாஷ்களை சரிபார்க்கவும்
vi: Kiểm băm

source: translator-credits
ar: Ibrahim Muhammad <ibrahim.muhammad.mu@outlook.com> Ali Aljishi <ahj696@hotmail.com> أحمد النجماوي <iramosu@protonmail.com>
ca: Maite Guix
de: Milo Ivir Panagiotis Vasilopoulos Philipp Kiemle Maximilian Salomon gregorni
el: Evangelos Paterakis
fr: Irénée Thirion Zohir Tamda
hr: Milo Ivir <mail@milotype.de>
it: musiclover382
nb_no: Brage Fuglseth https://bragefuglseth.dev
ta: K.B.Dharun Krishna <kbdharunkrishna@gmail.com>
vi: Kinten Le <kinten108101@protonmail.com>

source: %d of %d hashes calculated
ar: حُسِب %d من أصل %d تلبيد
de: %d von %d Prüfsummen berechnet
el: Υπολογίστηκαν %d από τα %d hashes
fr: %d hachages sur %d calculés
hr: %d od %d hasheva izračunato
it: %d di %d hash calcolati
nb_no: %d av %d avtrykk generert
ta: %d இல் %d ஹாஷ்கள் கணக்கிடப்பட்டன
vi: Tính xong %d băm trong tổng số %d

source: They Match
ar: يتطابقان
de: Übereinstimmung
el: Ταιριάζουν
fr: Ceux-ci correspondent
hr: Poklapaju se
it: Corrispondono
nb_no: De samsvarer
ta: அவை பொருந்துகின்றன

source: They Don't Match
ar: لا يتطابقان
de: Keine Übereinstimmung
el: Δεν Ταιριάζουν
fr: Ceux-ci ne correspondent pas
hr: Nepoklapaju se
it: Non corrispondono
nb_no: De samsvarer ikke
ta: அவை பொருந்தவில்லை

source: Pending
ar: قيد الانتظار

source: Drop to hash
ar: افلت للتبليد

source: https://en.wikipedia.org/wiki/Comparison_of_cryptographic_hash_functions
de: https://de.wikipedia.org/wiki/Kryptographische_Hashfunktion#%C3%9Cbersicht_von_Hashfunktionen

source: This tool aims to solve that. Collision comes with a simple &amp; clean UI, allowing anyone, from any age and experience group, to generate, compare and verify MD5, SHA-256, SHA-512 and SHA-1 hashes.
ca: Aquesta eina té com a objectiu solucionar-ho. Col·lisió ve amb una interfície d'usuari senzilla i neta, permetent a qualsevol persona, de qualsevol edat i experiència, generar, comparar i verificar els hashes MD5, SHA-256, SHA-512 i SHA-1.

source: MD5,SHA-1,SHA-256 or SHA-512 Hash
ca: Hash MD5, SHA-1, SHA-256 o SHA-512

source: Insert a MD5/SHA-1/SHA-256/SHA-512 Hash
ca: Inserir un hash MD5/SHA-1/SHA-256/SHA-512
