Repository: GeopJr/Collision
Catalog: po/kw.po
Languages: kw

source: Collision
kw: Kesskwat

source: Hash Generator
kw: Dinythor Hashys

source: Check hashes for your files
kw: Checkya hashys rag dha restrennow

source: Verifying that a file you downloaded or received is actually the one you were expecting is often overlooked or too time-consuming to do. At the same time, it has become very easy to get your hands on a file that has been tampered with, due to the mass increase of malicious webpages and other actors.
kw: Ow gwirhe unn restren dre ty iskargys po recevys yw an restren ty gwaytyasys yw fyllis gweles yn fenowgh po maga ta hir y gows dhe gul. Yn kettermyn, y yw pur es dhe iskarga unn restren mayth yw chanjys, drefen gwiasva drogbrederys.

source: This tool aims to solve that. Collision comes with a simple &amp; clean UI, allowing anyone, from any age and experience group, to generate, compare and verify MD5, SHA-256, SHA-512, SHA-1, Blake3, CRC32 and Adler32 hashes.
kw: An toul ma medra digelmi y. Kesskwat re unn ynterfas sempel, ow gasa nebonaw, a neb oos ha maystri, dinythi, komparya, ha gwirhe MD5, SHA-256, SHA-512, SHA-1, Blake3, CRC32, ha Adler32 hashys.

source: _New Window
kw: Fenester _Nowydh

source: _Compare Hash Functions
kw: _Komparya Eghennow Hash

source: _Keyboard Shortcuts
kw: Kesunyansow _Bysowek

source: _About Collision
kw: _A-dro Kesskwat

source: Choose a File
kw: Dewis unn Restren

source: _Open
kw: _Ygeri

source: Open…
kw: Ygeri…

source: Menu
kw: Rol

source: _Open a File
kw: _Ygeri unn Restren

source: Calculating Hashes
kw: Ow Kalkya Hashys

source: This might take a while
kw: Perthyans, mar pleg

source: Verify
kw: Gwirhe

source: Checksum
kw: Somm Check

source: MD5,SHA-1,SHA-256,SHA-512,Blake3,CRC32 or Adler32 Hash
kw: Hash MD5,SHA-1,SHA-256,SHA-512,Blake3,CRC32 po Adler32

source: Insert a MD5/SHA-1/SHA-256/SHA-512/Blake3/CRC32/Adler32 Hash
kw: Ynworra unn Hash MD5/SHA-1/SHA-256/SHA-512/Blake3/CRC32/Adler32

source: File
kw: Restren

source: Select Another File to Check Against
kw: Dewis Restren Aral dhe Checkya Erbynn

source: Choose File…
kw: Dewis Restren…

source: Copy
kw: Dasskrifa

source: General
kw: Ollgemmyn

source: Open a File
kw: Ygeri unn Restren

source: Show Keyboard Shortcuts
kw: Diskwedhes Kesunyansow Bysowek

source: New Window
kw: Fenester Nowydh

source: Close Window
kw: Degea Fenester

source: Quit
kw: Kwytya

source: Check Hashes
kw: Checkya Hashys

source: translator-credits
kw: Flynn <cirilla@tuta.io>

source: %d of %d hashes calculated
kw: %d a %d hashys kalkys

source: They Match
kw: I Omdhesedha

source: They Don't Match
kw: I Na Omdhesedha
